app/views/posts/detail.html.erb

    <ul>
      <% @post.comments.order("id desc").each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY id desc  [["post_id", 2]]