app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY vote_count desc
---
  def index
  @posts = Post.all.order("vote_count desc")

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "posts" SET "vote_count" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["vote_count", 1], ["updated_at", "2016-03-06 07:10:16.376430"], ["id", 9]]
---
  def upvote
    @post = Post.find params[:id]
    @post.update vote_count: (@post.vote_count + 1)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "vote_count" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["vote_count", 23], ["updated_at", "2016-03-07 03:59:08.568600"], ["id", 1]]
---
  def downvote
  @post = Post.find params[:id]
  @post.update vote_count: (@post.vote_count - 1)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "vote_count" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["vote_count", 23], ["updated_at", "2016-03-07 04:36:33.400080"], ["id", 1]]
---
  def detail
  @post = Post.find params[:id]
  @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 0]]
---
  def edit
     @post = Post.find_by id: params[:id]

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("comment_text", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment_text", "asdfasd"], ["post_id", 2], ["created_at", "2016-03-07 21:07:42.997398"], ["updated_at", "2016-03-07 21:07:42.997398"]]
---
  def create_comment

    # get the record
    @post = Post.find_by id: params[:id]
    @comment = Comment.new

    @comment.comment_text = params[:comment][:comment_text]
    @comment.post_id = @post.id
    # save it
    if @comment.save